package suiwu.bishe.com.suiwu;

import android.app.Application;
import android.content.SharedPreferences;
import android.util.Log;

import org.litepal.LitePal;

import java.util.ArrayList;

import suiwu.bishe.com.suiwu.database.Product;
import suiwu.bishe.com.suiwu.util.StrUtils;

/**
 * Created by Tryking on 2017/5/17.
 */

public class SuiWuApplication extends Application {
    @Override
    public void onCreate() {
        super.onCreate();
        LitePal.initialize(this);

        init();
    }

    private void init() {
        SharedPreferences pref = getSharedPreferences("data", MODE_PRIVATE);
        boolean updateDatabase = pref.getBoolean("updateDatabase", false);
        if (updateDatabase) {
            Log.e("数据库更新：", "数据库已经更新");
        } else {
            String s = "101210010\t改良种用濒危野马\t千克／头\t0\n" +
                    "101210090\t其他改良种用马\t千克／头\t5\n" +
                    "101290010\t非改良种用濒危野马\t千克／头\t0\n" +
                    "101290090\t非改良种用其他马\t千克／头\t5\n" +
                    "101301010\t改良种用的濒危野驴\t千克／头\t0\n" +
                    "101301090\t改良种用的其他驴\t千克／头\t5\n" +
                    "101309010\t非改良种用濒危野驴\t千克／头\t0\n" +
                    "101309090\t非改良种用其他驴\t千克／头\t5\n" +
                    "1019000\t骡\t千克／头\t5\n" +
                    "1022100\t改良种用家牛\t千克／头\t5\n" +
                    "1022900\t其他家牛\t千克／头\t5\n" +
                    "102310010\t改良种用濒危水牛\t千克／头\t0\n" +
                    "102310090\t改良种用其他水牛\t千克／头\t5\n" +
                    "102390010\t非改良种用濒危水牛\t千克／头\t0\n" +
                    "102390090\t非改良种用其他水牛\t千克／头\t5\n" +
                    "1051290\t重量≤185g的其他火鸡\t千克／只\t5\n" +
                    "1051310\t重量不超过185克的改良种用鸭\t千克／只\t5\n" +
                    "1051390\t重量不超过185克的其他鸭\t千克／只\t5\n" +
                    "1051410\t重量不超过185克的改良种用鹅\t千克／只\t5\n" +
                    "1051490\t重量不超过185克的其他鹅\t千克／只\t5\n" +
                    "1051510\t重量不超过185克的改良种用珍珠鸡\t千克／只\t5\n" +
                    "1051590\t重量不超过185克的其他珍珠鸡\t千克／只\t5\n" +
                    "1059410\t重量＞185g的改良种用鸡\t千克／只\t5\n" +
                    "1059490\t重量＞185g的其他鸡\t千克／只\t5\n" +
                    "1059910\t重量＞185g的其他改良种用家禽\t千克／只\t5\n" +
                    "1059991\t重量＞185g的非改良种用鸭\t千克／只\t5\n" +
                    "1059992\t重量＞185g的非改良种用鹅\t千克／只\t5\n" +
                    "1059993\t重量＞185g的非改良种用珍珠鸡\t千克／只\t5\n" +
                    "1059994\t重量＞185g的非改良种用火鸡\t千克／只\t5\n" +
                    "1061110\t改良种用灵长目动物\t千克／只\t5\n" +
                    "1051290\t重量≤185g的其他火鸡\t千克／只\t5\n" +
                    "1051310\t重量不超过185克的改良种用鸭\t千克／只\t5\n" +
                    "1051390\t重量不超过185克的其他鸭\t千克／只\t5\n" +
                    "1051410\t重量不超过185克的改良种用鹅\t千克／只\t5\n" +
                    "1051490\t重量不超过185克的其他鹅\t千克／只\t5\n" +
                    "1051510\t重量不超过185克的改良种用珍珠鸡\t千克／只\t5\n" +
                    "1051590\t重量不超过185克的其他珍珠鸡\t千克／只\t5\n" +
                    "1059410\t重量＞185g的改良种用鸡\t千克／只\t5\n" +
                    "1059490\t重量＞185g的其他鸡\t千克／只\t5\n" +
                    "1059910\t重量＞185g的其他改良种用家禽\t千克／只\t5\n" +
                    "1059991\t重量＞185g的非改良种用鸭\t千克／只\t5\n" +
                    "1059992\t重量＞185g的非改良种用鹅\t千克／只\t5\n" +
                    "1059993\t重量＞185g的非改良种用珍珠鸡\t千克／只\t5\n" +
                    "1059994\t重量＞185g的非改良种用火鸡\t千克／只\t5\n" +
                    "1061110\t改良种用灵长目动物\t千克／只\t5\n" +
                    "1061190\t其他灵长目动物\t千克／只\t5\n" +
                    "1061211\t改良种用鲸、海豚及鼠海豚；海牛及儒艮\t千克／只\t5\n" +
                    "1061219\t其他鲸、海豚及鼠海豚；海牛及儒艮\t千克／只\t5\n" +
                    "1061221\t改良种用海豹、海狮及海象\t千克／只\t5\n" +
                    "1061229\t其他海豹、海狮及海象\t千克／只\t5\n" +
                    "106131010\t改良种用濒危骆驼及其他濒危骆驼科动物(包括人工驯养、繁殖的)\t千克／只\t0\n" +
                    "106131090\t其他改良种用骆驼及其他骆驼科动物\t千克／只\t5\n" +
                    "106139010\t其他濒危骆驼及其他濒危骆驼科动物(包括人工驯养、繁殖的)\t千克／只\t0\n" +
                    "106139090\t其他骆驼及其他骆驼科动物\t千克／只\t5\n" +
                    "106141010\t改良种用濒危野兔(包括人工驯养、繁殖的)\t千克／只\t0\n" +
                    "106141090\t改良种用家兔及其他改良种用野兔\t千克／只\t5\n" +
                    "106149010\t其他濒危野兔(包括人工驯养、繁殖的)\t千克／只\t0\n" +
                    "106149090\t其他家兔及野兔\t千克／只\t5\n" +
                    "106191010\t其他改良种用濒危哺乳动物(包括人工驯养、繁殖的)\t千克／只\t0\n" +
                    "106191090\t其他改良种用哺乳动物\t千克／只\t5\n" +
                    "106199010\t其他濒危哺乳动物(包括人工驯养、繁殖的)\t千克／只\t0\n" +
                    "106199090\t其他哺乳动物\t千克／只\t5\n" +
                    "1062011\t改良种用鳄鱼苗\t千克／只\t5\n" +
                    "1062019\t其他改良种用爬行动物\t千克／只\t5\n" +
                    "106202010\t食用蛇(包括人工驯养、繁殖的)\t千克／只\t5\n" +
                    "106202021\t食用濒危龟鳖(包括人工驯养、繁殖的)\t千克／只\t0\n" +
                    "106202029\t其他食用龟鳖(包括人工驯养、繁殖的)\t千克／只\t5\n" +
                    "106202090\t其他食用爬行动物(包括人工驯养、繁殖的)\t千克／只\t5\n" +
                    "1062090\t其他爬行动物\t千克／只\t5\n" +
                    "1063110\t改良种用猛禽\t千克／只\t5\n" +
                    "1063190\t其他猛禽\t千克／只\t5\n" +
                    "1063210\t改良种用鹦形目鸟\t千克／只\t5\n" +
                    "1063290\t其他鹦形目鸟\t千克／只\t5\n" +
                    "106331010\t改良种用濒危鸵鸟(包括人工驯养、繁殖的)\t千克／只\t0\n" +
                    "106331090\t其他改良种用鸵鸟和改良种用鸸鹋\t千克／只\t5\n" +
                    "106339010\t其他濒危鸵鸟(包括人工驯养、繁殖的)\t千克／只\t0\n" +
                    "106339090\t其他鸵鸟、鸸鹋\t千克／只\t5\n" +
                    "106391010\t其他改良种用濒危鸟(包括人工驯养、繁殖的)\t千克／只\t0\n" +
                    "106391090\t其他改良种用的鸟\t千克／只\t5\n" +
                    "1063921\t乳鸽\t千克／只\t5\n" +
                    "1063923\t野鸭\t千克／只\t5\n" +
                    "106392910\t其他食用濒危鸟(包括人工驯养、繁殖的)\t千克／只\t0\n" +
                    "106392990\t其他食用鸟\t千克／只\t5\n" +
                    "106399010\t其他濒危鸟(包括人工驯养、繁殖的)\t千克／只\t0\n" +
                    "106399090\t其他鸟\t千克／只\t5\n" +
                    "1064110\t改良种用蜂\t千克／只\t5\n" +
                    "1064190\t其他蜂\t千克／只\t5\n" +
                    "106491010\t其他改良种用濒危昆虫(包括人工驯养、繁殖的)\t千克／只\t0\n" +
                    "106491090\t其他改良种用非濒危昆虫\t千克／只\t5\n" +
                    "106499001\t捕食螨\t千克／只\t5\n" +
                    "106499010\t其他濒危昆虫(包括人工驯养、繁殖的)\t千克／只\t0\n" +
                    "106499090\t其他非濒危昆虫\t千克／只\t5\n" +
                    "106901110\t改良种用濒危蛙苗\t千克／只\t0\n" +
                    "106901190\t其他改良种用蛙苗\t千克／只\t5\n" +
                    "106901910\t其他改良种用濒危动物(包括人工驯养、繁殖的)\t千克／只\t0\n" +
                    "106901990\t其他改良种用动物\t千克／只\t5\n" +
                    "106909010\t其他濒危动物(包括人工驯养、繁殖的)\t千克／只\t0\n" +
                    "106909090\t其他动物\t千克／只\t5\n" +
                    "2011000\t整头及半头鲜、冷牛肉\t千克\t5\n" +
                    "2012000\t鲜、冷的带骨牛肉\t千克\t5\n" +
                    "201300010\t鲜或冷藏的去骨野牛肉\t千克\t5\n" +
                    "201300090\t其他鲜或冷藏的去骨牛肉\t千克\t13\n" +
                    "2021000\t冻的整头及半头牛肉\t千克\t5\n" +
                    "2022000\t冻的带骨牛肉\t千克\t5\n" +
                    "202300010\t冻藏的去骨野牛肉\t千克\t5\n" +
                    "202300090\t其他冻藏的去骨牛肉\t千克\t13\n" +
                    "2031110\t鲜、冷的整头及半头乳猪肉\t千克\t5\n" +
                    "2031190\t其他鲜、冷的整头及半头猪肉\t千克\t5\n" +
                    "2031200\t鲜、冷的带骨猪前腿、后腿及其肉块\t千克\t5\n" +
                    "2031900\t其他鲜、冷猪肉\t千克\t5\n" +
                    "2032110\t冻整头及半头乳猪肉\t千克\t5\n" +
                    "2032190\t其他冻整头及半头猪肉\t千克\t5\n" +
                    "2032200\t冻的带骨猪前腿、后腿及其肉块\t千克\t5\n" +
                    "203290010\t冻藏野猪其他肉\t千克\t5\n" +
                    "2032900101\t除分割野猪肉以外的冻藏野猪其他肉\t千克\t5\n" +
                    "2032900102\t分割野猪肉\t千克\t13\n" +
                    "203290090\t其他冻藏猪肉\t千克\t5\n" +
                    "2032900901\t除分割猪肉以外的其他冻藏猪肉\t千克\t5\n" +
                    "2032900902\t分割猪肉\t千克\t13\n" +
                    "2041000\t鲜或冷的整头及半头羔羊\t千克\t5\n";
            ArrayList<Product> products = StrUtils.ReadProduct(s);
            Log.e("商品列表", products.toString());
            for (int i = 0; i < products.size(); i++) {
                Product product = new Product();
                product.setCoding(products.get(i).getCoding());
                product.setName(products.get(i).getName());
                product.setUint(products.get(i).getUint());
                product.setTaxRate(products.get(i).getTaxRate());
                product.save();
            }
            SharedPreferences.Editor edit = pref.edit();
            edit.putBoolean("updateDatabase", true);
            edit.apply();
        }
    }

}
